datasets/cfdBase/baseCaseHighRe/level0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1. 0 0);

boundaryField
{   
    Left 
    {
      type             fixedValue;
      value           uniform (1. 0 0);
    }

    Upper 
    {
            type             fixedValue;
      value           uniform (1. 0 0);
    }

    Lower 
    {
            type             fixedValue;
      value           uniform (1. 0 0);
    }
    
    Right
    {
      type              zeroGradient;
    }

    Side
    {
        type            empty;
    }

    Object
    {
        type            noSlip;
    }
}


// ************************************************************************* //
